# Instalacion del Connector/Python/MYSQL

In [ ]:
#pip install mysql-connector-python
import mysql.connector

In [ ]:
from mysql.connector import connect,Error
try:
    with connect(
        host="localhost",
        user="root",
        password="Rioazulq12"
    )as connection:
        print(connection)
except Error as e:
    print(e)

# Creacion de Base de datos

<img src="E_R.png" />

In [ ]:
from mysql.connector import connect,Error
try:
    with connect(
        host="localhost",
        user="root",
        password="Rioazulq12"
    )as connection:
        create_db_query = "CREATE DATABASE movies_online"
        with connection.cursor() as cursor:
            cursor.execute(create_db_query)
except Error as e:
    print(e)

# Creacion de Tablas

In [ ]:
import mysql.connector
connection = mysql.connector.connect(
     host="localhost",
     user="root",
     password="Rioazulq12",
     database="movies_online"
  )

create_movies_table_query= """
CREATE TABLE movies(
   id INT AUTO_INCREMENT PRIMARY KEY,
   title VARCHAR(100),
   release_year YEAR(4),
   genre VARCHAR(100),
   collection_in_mil INT
  )
"""
with connection.cursor() as cursor:
    cursor.execute(create_movies_table_query)
    connection.commit() #Ejecutar fisicamente los cambios en LA BD

In [ ]:
def conexion_bd():
    connection = mysql.connector.connect(
        host="localhost",
        user="root",
        password="Rioazulq12",
        database="movies_online"
  )
    return connection

# Insertar Registros a la Tabla

In [ ]:
insert_movies_query = """
INSERT INTO movies (title,release_year,genre,collection_in_mil)
VALUES
  ("3 Idiots", 2009, "Drama", 2.4),
    ("Eternal Sunshine of the Spotless Mind", 2004, "Drama", 34.5),
    ("Good Will Hunting", 1997, "Drama", 138.1),
    ("Skyfall", 2012, "Action", 304.6),
    ("Gladiator", 2000, "Action", 188.7),
    ("Black", 2005, "Drama", 3.0),
    ("Titanic", 1997, "Romance", 659.2),
    ("The Shawshank Redemption", 1994, "Drama",28.4),
    ("Udaan", 2010, "Drama", 1.5),
    ("Home Alone", 1990, "Comedy", 286.9),
    ("Casablanca", 1942, "Romance", 1.0),
    ("Avengers: Endgame", 2019, "Action", 858.8),
    ("Night of the Living Dead", 1968, "Horror", 2.5),
    ("The Godfather", 1972, "Crime", 135.6),
    ("Haider", 2014, "Action", 4.2),
    ("Inception", 2010, "Adventure", 293.7),
    ("Evil", 2003, "Horror", 1.3),
    ("Toy Story 4", 2019, "Animation", 434.9),
    ("Air Force One", 1997, "Drama", 138.1),
    ("The Dark Knight", 2008, "Action",535.4),
    ("Bhaag Milkha Bhaag", 2013, "Sport", 4.1),
    ("The Lion King", 1994, "Animation", 423.6),
    ("Pulp Fiction", 1994, "Crime", 108.8),
    ("Kai Po Che", 2013, "Sport", 6.0),
    ("Beasts of No Nation", 2015, "War", 1.4),
    ("Andadhun", 2018, "Thriller", 2.9),
    ("The Silence of the Lambs", 1991, "Crime", 68.2),
    ("Deadpool", 2016, "Action", 363.6),
    ("Drishyam", 2015, "Mystery", 3.0)
"""

#Creando un Objeto de Conexion
obj_conexion=conexion_bd()

with obj_conexion.cursor() as cursor:
    cursor.execute(insert_movies_query)
    obj_conexion.commit() #Ejecutar fisicamente los cambios en LA BD

In [ ]:
create_reviewers_tabla_query ="""
CREATE TABLE reviewers (
   id INT AUTO_INCREMENT PRIMARY KEY,
   first_name VARCHAR(100),
   last_name VARCHAR(100)
)
"""

#Creando un Objeto de Conexion
obj_conexion=conexion_bd()

with obj_conexion.cursor() as cursor:
    cursor.execute(create_reviewers_tabla_query)
    obj_conexion.commit() #Ejecutar fisicamente los cambios en LA BD

In [ ]:
insert_reviewers_query="""
INSERT INTO reviewers
(first_name,last_name)
VALUES(%s,%s)
"""

reviewers_records = [
    ("Chaitanya", "Baweja"),
    ("Mary", "Cooper"),
    ("John", "Wayne"),
    ("Thomas", "Stoneman"),
    ("Penny", "Hofstadter"),
    ("Mitchell", "Marsh"),
    ("Wyatt", "Skaggs"),
    ("Andre", "Veiga"),
    ("Sheldon", "Cooper"),
    ("Kimbra", "Masters"),
    ("Kat", "Dennings"),
    ("Bruce", "Wayne"),
    ("Domingo", "Cortes"),
    ("Rajesh", "Koothrappali"),
    ("Ben", "Glocker"),
    ("Mahinder", "Dhoni"),
    ("Akbar", "Khan"),
    ("Howard", "Wolowitz"),
    ("Pinkie", "Petit"),
    ("Gurkaran", "Singh"),
    ("Amy", "Farah Fowler"),
    ("Marlon", "Crafford"),
]

#Creando un Objeto de Conexion
obj_conexion=conexion_bd()

with obj_conexion.cursor() as cursor:
    cursor.executemany(insert_reviewers_query,reviewers_records)
    obj_conexion.commit() #Ejecutar fisicamente los cambios en LA BD

In [ ]:
create_ratings_table_query="""
CREATE TABLE ratings (
   movie_id  INT,
   reviewer_id INT,
   rating DECIMAL(2,1),
   FOREIGN KEY(movie_id) REFERENCES movies(id),
   FOREIGN KEY(reviewer_id) REFERENCES reviewers(id),
   PRIMARY KEY(movie_id,reviewer_id)
)

"""

#Creando un Objeto de Conexion
obj_conexion=conexion_bd()

with obj_conexion.cursor() as cursor:
    cursor.execute(create_ratings_table_query)
    obj_conexion.commit() #Ejecutar fisicamente los cambios en LA BD

In [ ]:
insert_ratings_query ="""
INSERT INTO ratings
(rating,movie_id,reviewer_id)
VALUES(%s , %s ,%s)
"""
ratings_records = [
    (6.4, 17, 5), (5.6, 19, 1), (6.3, 22, 14), (5.1, 21, 17),
    (5.0, 5, 5), (6.5, 21, 5), (8.5, 30, 13), (9.7, 6, 4),
    (8.5, 24, 12), (9.9, 14, 9), (8.7, 26, 14), (9.9, 6, 10),
    (5.1, 30, 6), (5.4, 18, 16), (6.2, 6, 20), (7.3, 21, 19),
    (8.1, 17, 18), (5.0, 7, 2), (9.8, 23, 3), (8.0, 22, 9),
    (8.5, 11, 13), (5.0, 5, 11), (5.7, 8, 2), (7.6, 25, 19),
    (5.2, 18, 15), (9.7, 13, 3), (5.8, 18, 8), (5.8, 30, 15),
    (8.4, 21, 18), (6.2, 23, 16), (7.0, 10, 18), (9.5, 30, 20),
    (8.9, 3, 19), (6.4, 12, 2), (7.8, 12, 22), (9.9, 15, 13),
    (7.5, 20, 17), (9.0, 25, 6), (8.5, 23, 2), (5.3, 30, 17),
    (6.4, 5, 10), (8.1, 5, 21), (5.7, 22, 1), (6.3, 28, 4),
    (9.8, 13, 1)
]


#Creando un Objeto de Conexion
obj_conexion=conexion_bd()

with obj_conexion.cursor() as cursor:
    cursor.executemany(insert_ratings_query,ratings_records)
    obj_conexion.commit() #Ejecutar fisicamente los cambios en LA BD

# Estructura de la Tabla

In [ ]:
#Creando un Objeto de Conexion
obj_conexion=conexion_bd()

show_table_query="describe movies"

with obj_conexion.cursor() as cursor:
    cursor.execute(show_table_query)
    result = cursor.fetchall()
    for row in result:
        print(row)

# Instrucciones SQL

In [ ]:
#Mostrar Los primeros 15 registros
select_movies_query="SELECT * FROM movies LIMIT 15"

#Creando un Objeto de Conexion
obj_conexion=conexion_bd()

with obj_conexion.cursor() as cursor:
    cursor.execute(select_movies_query)
    result = cursor.fetchall()
    for row in result:
        print(row)

In [ ]:
#Seleccionar Algunos campos
select_movies_query="SELECT title,release_year FROM movies LIMIT 15"

#Creando un Objeto de Conexion
obj_conexion=conexion_bd()

with obj_conexion.cursor() as cursor:
    cursor.execute(select_movies_query)
    result = cursor.fetchall()
    for row in result:
        print(row)

In [ ]:
#Utilizando Filtros WHERE Ordenando los resultados
select_movies_query="""
        SELECT title,collection_in_mil 
        FROM movies 
        WHERE collection_in_mil >100
        ORDER BY collection_in_mil DESC
        """

#Creando un Objeto de Conexion
obj_conexion=conexion_bd()

with obj_conexion.cursor() as cursor:
    cursor.execute(select_movies_query)
    result = cursor.fetchall()
    for row in result:
        print(row)

In [ ]:
select_movies_avg="""
  SELECT title,avg(rating) average_rating from movies m inner join ratings r 
       on  m.id=r.movie_id
       group by movie_id
       order by average_rating desc
       LIMIT 20
"""

#Creando un Objeto de Conexion
obj_conexion=conexion_bd()

with obj_conexion.cursor() as cursor:
    cursor.execute(select_movies_avg)
    result = cursor.fetchall()
    for row in result:
        print(row)

In [ ]:
movie_id = input("Ingrese el ID de la Pelicula")
reviewer_id = input("Ingrese el ID del reviewer")

select_movies_avg="""
SELECT title,r.reviewer_id,avg(rating) average_rating 
       from movies m inner join ratings r 
       on  m.id=r.movie_id
       where m.id=%s and r.reviewer_id=%s
       group by movie_id
"""

val_tuple=(
    movie_id,
    reviewer_id,
)
#Creando un Objeto de Conexion
obj_conexion=conexion_bd()

with obj_conexion.cursor() as cursor:
    existe=False
    for result in cursor.execute(select_movies_avg,val_tuple,multi=True):
        if result.with_rows:
            existe=True
            print(result.fetchall())
            break
    if existe==False:
        print("Nada que Mostra")

# Base datos & DataFrame

In [ ]:
import pandas as pd
import sqlite3

In [ ]:
c=conn.cursor()
c.execute('CREATE TABLE IF NOT EXISTS products (product_name text,price number)')
conn.commit()

In [ ]:
conn = sqlite3.connect('bdlocal_mayo_2023')
c.execute('CREATE TABLE IF NOT EXISTS products (product_name text,price number)')
conn.commit()

data = {'product_name': ['Computer','Tablet','Monitor','Printer'],
        'price': [900,300,450,150]
        }
#Preparndo el DataFrame o la Estructura del DataFrame para imporar los datos de SQL
df = pd.DataFrame(data,columns=['product_name','price'])
df.to_sql('products',conn,if_exists='replace',index=False)
c.execute('''
SELECT * FROM PRODUCTS
''')
#Importando la informacio
df = pd.DataFrame(c.fetchall(),columns=['product_name','price'])

In [ ]:
df.head(1)

In [ ]:
#Utilizando Filtros WHERE Ordenando los resultados
movie_id = input("Ingrese el ID de la Pelicula")
select_movies_query="""
        SELECT * FROM movies where id=%s 
        """

val_tuple=(
    movie_id,
)

#Creando un Objeto de Conexion
obj_conexion=conexion_bd()

with obj_conexion.cursor() as cursor:
    cursor.execute(select_movies_query,val_tuple)
    #me devolvera solo un registro usar fethone
    result = cursor.fetchone()
    print(result)

# Fetchall() 
recuperar "N" Registros y esta devolvera una lista de tuplas
# Fetchone() 
recuperar "1" Registro y esta devolvera una tupla

# Origenes de Datos JSON

In [2]:
cars = [
    {"name":"Honda","price":10000,"model":2020,"power":1300},
    {"name":"Toyota","price":12000,"model":2021,"power":1500},
    {"name":"Audi","price":15000,"model":2022,"power":1730},
    {"name":"Ford","price":18000,"model":2010,"power":1700},
]

In [3]:
cars

[{'name': 'Honda', 'price': 10000, 'model': 2020, 'power': 1300},
 {'name': 'Toyota', 'price': 12000, 'model': 2021, 'power': 1500},
 {'name': 'Audi', 'price': 15000, 'model': 2022, 'power': 1730},
 {'name': 'Ford', 'price': 18000, 'model': 2010, 'power': 1700}]

In [4]:
#Generando mi archivo en Formato JSON
import json
with open("cars.json","w") as f:
    json.dump(cars,f)

In [5]:
import pandas as pd
df_autos=pd.read_json('cars.json')

In [6]:
df_autos

     name  price  model  power
0   Honda  10000   2020   1300
1  Toyota  12000   2021   1500
2    Audi  15000   2022   1730
3    Ford  18000   2010   1700

In [7]:
import pandas as pd
df_iris_f=pd.read_json('https://raw.githubusercontent.com/domoritz/maps/master/data/iris.json')
df_iris_f.head()

   sepalLength  sepalWidth  petalLength  petalWidth species
0          5.1         3.5          1.4         0.2  setosa
1          4.9         3.0          1.4         0.2  setosa
2          4.7         3.2          1.3         0.2  setosa
3          4.6         3.1          1.5         0.2  setosa
4          5.0         3.6          1.4         0.2  setosa

# Trabajando con data Existente

In [8]:
import pandas
import mysql.connector

# Conectarme a la BD por medio de argumentos

In [10]:
cnx = mysql.connector.connect(user='root',password='Rioazulq12',database='Northwind',port='3306')

In [11]:
cnx

# Ejecutar consultas del servidor en un Dataframe

In [12]:
query = pd.read_sql_query

In [15]:
result1= query ("select * from customer",cnx)
result1

result2= query ("select * from customer where city='México D.F.'",cnx)
result2

,custId,companyName,contactName,contactTitle,address,city,region,postalCode,country,phone,mobile,email,fax
0,2,Customer MLTDN,"Hassall, Mark",Owner,Avda. de la Constitución 5678,México D.F.,None,10077,Mexico,(5) 789-0123,None,None,(5) 456-7890
1,3,Customer KBUDE,"Peoples, John",Owner,Mataderos 7890,México D.F.,None,10097,Mexico,(5) 123-4567,None,None,None
2,13,Customer VMLOG,"Benito, Almudena",Marketing Manager,Sierras de Granada 7890,México D.F.,None,10056,Mexico,(5) 456-7890,None,None,(5) 123-4567
3,58,Customer AHXHT,"Fakhouri, Fadi",Sales Representative,Calle Dr. Jorge Cash 8901,México D.F.,None,10116,Mexico,(5) 890-1234,None,None,(5) 567-8901
4,80,Customer VONTK,"Geschwandtner, Jens",Owner,Avda. Azteca 4567,México D.F.,None,10044,Mexico,(5) 678-9012,None,None,None

In [20]:
result3= query ("select * from customer where country in('Mexico','UK','Canada')",cnx)
result3.head(2)

,custId,companyName,contactName,contactTitle,address,city,region,postalCode,country,phone,mobile,email,fax
0,2,Customer MLTDN,"Hassall, Mark",Owner,Avda. de la Constitución 5678,México D.F.,None,10077,Mexico,(5) 789-0123,None,None,(5) 456-7890
1,3,Customer KBUDE,"Peoples, John",Owner,Mataderos 7890,México D.F.,None,10097,Mexico,(5) 123-4567,None,None,None

In [23]:
result4= query ("select * from customer where country like '%A%'",cnx)
result4.head(2)

,custId,companyName,contactName,contactTitle,address,city,region,postalCode,country,phone,mobile,email,fax
0,12,Customer PSNMQ,"Ray, Mike",Sales Agent,Cerrito 3456,Buenos Aires,None,10057,Argentina,(1) 890-1234,None,None,(1) 567-8901
1,20,Customer THHDP,"Kane, John",Sales Manager,Kirchgasse 9012,Graz,None,10059,Austria,1234-5678,None,None,9012-3456

In [30]:
result4= query ("select * from product where unitPrice between 10 and 12",cnx)
result4.head(20)
df_export=result4.to_csv('Precios_10_12',index=True)